# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

# DA Network
da:
  [
   [20, 1, nn.Upsample, [None, 2, 'nearest']], # 25

   [23, 1, nn.Upsample, [None, 4, 'nearest']], # 26

   [[17, 25, 26], 1, Concat, [1]],  # cat head P5 ; Should be [bs,192+384+768,128,128]
   #[-1, 1, GradReverse, [1]],
   [-1, 1, Conv, [64, 1, 1]], # 28 => 64x64
   [-1, 1, Conv, [56, 3, 2]], # 29 => 64x64
   [-1, 1, Conv, [48, 3, 2]], # 30 => 32x32
   [-1, 1, GlobalAveragePooling, [48]], #31
   [31, 1, Linear, [4]], #32
   [31, 1, Linear, [6]], #33
   [31, 1, Linear, [354]], #34
   #[-1, 1, Conv, [6, 3, 2]], # 31 => 8x8; Predict Scanner
   #[-1, 1, Conv, [6, 3, 2]], # 32 => 8x8; Predict Tumortype
   #[-1, 1, Conv, [6, 3, 2]], # 33 => 8x8; Predict BiopsieID
   #
  ]


